package OnlineTests.wordsJump0415;

/**
 * 题目描述
 * 升序数组中第一个是1， 后续为若干连续的素数，对于数组里面的元素m和n（m < n）都对应了一个有理数m / n, 现在给定这个数组和一个K，要求返回第K小的有理数。
 * 输入描述:
 * 每组测试样本的输入格式为：
 * 第一行是一个正整数N
 * 从第二行开始，每行有若干个正整数，依次存放K、a1、……、an，一共有N行，也就是N组参数。
 * K是输入参数表示需要寻找的顺序第K小的有理数， a1 - an 是以1开始后续n - 1个素数。
 * 输出描述:
 * 输出有N行，每行两个数字m和n，空格隔开，分别表示第K小有理数的分子和分母。
 * 示例1
 * 输入
 * 1
 * 3 1 2 3 5
 * 输出
 * 2 5
 * 备注:
 * m、n必须为a1 - an中的满足条件的两个数。
 * 数据范围为：
 * 10 <= N <= 20000
 * 10 <= K <= 20000
 * 1 <= m < n < 20000
 */
public class Question4 {
}
